const getAll = 
    `SELECT 
        ЛИЧНКАРТ.ТАБН, [ЛИЧНОКАРТ I Общие сведения].ФИО, ЛИЧНКАРТ.ИНН,
        [ЛИЧНОКАРТ I Общие сведения].ДАТАРОЖД, [ЛИЧНОКАРТ I Общие сведения].ТЕЛ,
        [ЛИЧНОКАРТ I Общие сведения].АДРЕСПаспорт, ЛИЧНКАРТ.Логин
    FROM 
        ЛИЧНКАРТ INNER JOIN [ЛИЧНОКАРТ I Общие сведения]
        ON ЛИЧНКАРТ.ТАБН = [ЛИЧНОКАРТ I Общие сведения].ТАБН;`;

 const getPreSalary= 
    `
    SELECT ЛИЧНКАРТ.ТАБН, [ЛИЧНОКАРТ I Общие сведения].ФИО, Sum([ШТАТНОЕ РАСПИСАНИЕ].МИНОКЛАД) AS [Sum-МИНОКЛАД],
    Sum([МИНОКЛАД]*[ШТАТНОЕ РАСПИСАНИЕ].[ПОВЫШПОГРУПП]) AS [Повышение по группам оплаты],
    Sum([МИНОКЛАД]*[ШТАТНОЕ РАСПИСАНИЕ].[ПОВЫШОБРАЗОВ]) AS [Повышение за образование],
    Sum([МИНОКЛАД]*[ШТАТНОЕ РАСПИСАНИЕ].[ПОВЫШКВАЛИФ]) AS [Повышение за квалификацию],
    Sum([ШТАТНОЕ РАСПИСАНИЕ].[КОМПЕНС]) AS [Компенсация за литературу],
    Sum([МИНОКЛАД]*[ШТАТНОЕ РАСПИСАНИЕ].[ПОВЫШПОГРУПП]*[ШТАТНОЕ РАСПИСАНИЕ].[ПОВЫШОБРАЗОВ]*[ШТАТНОЕ РАСПИСАНИЕ].[ПОВЫШКВАЛИФ]+[ШТАТНОЕ РАСПИСАНИЕ].[КОМПЕНС]) AS [Итого оклад]
    FROM [ШТАТНОЕ РАСПИСАНИЕ] INNER JOIN (ЛИЧНКАРТ INNER JOIN ([ЛИЧНОКАРТ I Общие сведения] INNER JOIN [ДОЛЖ СОТР] ON [ЛИЧНОКАРТ I Общие сведения].ТАБН = [ДОЛЖ СОТР].ТАБН) ON (ЛИЧНКАРТ.ТАБН = [ЛИЧНОКАРТ I Общие сведения].ТАБН) AND (ЛИЧНКАРТ.ТАБН = [ДОЛЖ СОТР].ТАБН)) ON [ШТАТНОЕ РАСПИСАНИЕ].КОДДОЛЖН = [ДОЛЖ СОТР].КОДДОЛЖН
    WHERE ЛИЧНКАРТ.ТАБН = @empId OR [ЛИЧНОКАРТ I Общие сведения].ФИО = @empId
    GROUP BY ЛИЧНКАРТ.ТАБН, [ЛИЧНОКАРТ I Общие сведения].ФИО;
    `;    
const getSurcharges = `
    SELECT ЛИЧНКАРТ.ТАБН, [ЛИЧНОКАРТ I Общие сведения].ФИО, Sum([ДОПЛ СОТР].РАЗМЕР) AS [Sum-РАЗМЕР]
    FROM [ШТАТНОЕ РАСПИСАНИЕ] INNER JOIN (ЛИЧНКАРТ INNER JOIN (ДОПЛАТЫ INNER JOIN (([ЛИЧНОКАРТ I Общие сведения] INNER JOIN [ДОЛЖ СОТР] ON [ЛИЧНОКАРТ I Общие сведения].ТАБН = [ДОЛЖ СОТР].ТАБН) INNER JOIN [ДОПЛ СОТР] ON [ДОЛЖ СОТР].ДОЛЖНСОТР = [ДОПЛ СОТР].ДОЛЖСОТР) ON ДОПЛАТЫ.КОДДОПЛ = [ДОПЛ СОТР].КОДДОПЛ) ON (ЛИЧНКАРТ.ТАБН = [ЛИЧНОКАРТ I Общие сведения].ТАБН) AND (ЛИЧНКАРТ.ТАБН = [ДОЛЖ СОТР].ТАБН)) ON [ШТАТНОЕ РАСПИСАНИЕ].КОДДОЛЖН = [ДОЛЖ СОТР].КОДДОЛЖН
    WHERE ЛИЧНКАРТ.ТАБН = @empId OR [ЛИЧНОКАРТ I Общие сведения].ФИО = @empId
    GROUP BY ЛИЧНКАРТ.ТАБН, [ЛИЧНОКАРТ I Общие сведения].ФИО
    ORDER BY ЛИЧНКАРТ.ТАБН;
`;

const getDutiesList = `
    SELECT [ШТАТНОЕ РАСПИСАНИЕ].НАИМДОЛЖН
    FROM [ШТАТНОЕ РАСПИСАНИЕ] INNER JOIN (ЛИЧНКАРТ INNER JOIN ([ЛИЧНОКАРТ I Общие сведения] 
    INNER JOIN [ДОЛЖ СОТР] ON [ЛИЧНОКАРТ I Общие сведения].ТАБН = [ДОЛЖ СОТР].ТАБН) ON (ЛИЧНКАРТ.ТАБН = [ЛИЧНОКАРТ I Общие сведения].ТАБН)
    AND (ЛИЧНКАРТ.ТАБН = [ДОЛЖ СОТР].ТАБН)) ON [ШТАТНОЕ РАСПИСАНИЕ].КОДДОЛЖН = [ДОЛЖ СОТР].КОДДОЛЖН
    WHERE ЛИЧНКАРТ.ТАБН = @empId OR [ЛИЧНОКАРТ I Общие сведения].ФИО = @empId   
    GROUP BY ЛИЧНКАРТ.ТАБН, [ЛИЧНОКАРТ I Общие сведения].ФИО, [ШТАТНОЕ РАСПИСАНИЕ].НАИМДОЛЖН;
`;

const getSurchargesList = `
SELECT ДОПЛАТЫ.НАЗВАДОП
    FROM (ЛИЧНКАРТ INNER JOIN (ДОПЛАТЫ INNER JOIN ([ДОЛЖ СОТР] INNER JOIN
    [ДОПЛ СОТР] ON [ДОЛЖ СОТР].ДОЛЖНСОТР = [ДОПЛ СОТР].ДОЛЖСОТР) ON ДОПЛАТЫ.КОДДОПЛ = [ДОПЛ СОТР].КОДДОПЛ)
    ON ЛИЧНКАРТ.ТАБН = [ДОЛЖ СОТР].ТАБН) INNER JOIN [ЛИЧНОКАРТ I Общие сведения] ON ([ДОЛЖ СОТР].ТАБН = [ЛИЧНОКАРТ I Общие сведения].ТАБН) 
    AND (ЛИЧНКАРТ.ТАБН = [ЛИЧНОКАРТ I Общие сведения].ТАБН)
    WHERE ЛИЧНКАРТ.ТАБН = @empId OR [ЛИЧНОКАРТ I Общие сведения].ФИО = @empId;
`;
module.exports = {
    getAll,
    getPreSalary,
    getSurcharges,
    getSurchargesList,
    getDutiesList,
};